In [41]:
import pandas as pd 
import sqlite3

In [2]:
con = sqlite3.connect("database01.db")
cur = con.cursor()

In [3]:
pd.set_option('display.max_columns', None)

In [4]:
%load_ext sql
%sql sqlite:///database01.db

In [21]:
%%sql
DROP TABLE EMPLOYEES;
DROP TABLE JOB_HISTORY;
DROP TABLE JOBS;
DROP TABLE DEPARTMENTS;
DROP TABLE LOCATIONS;

 * sqlite:///database01.db
Done.
Done.
Done.
Done.
Done.

[]

In [24]:
%%sql
-- Create the tables

CREATE TABLE EMPLOYEES (
                          EMP_ID CHAR(9) NOT NULL,
                          F_NAME VARCHAR(15) NOT NULL,
                          L_NAME VARCHAR(15) NOT NULL,
                          SSN CHAR(9),
                          B_DATE DATE,
                          SEX CHAR,
                          ADDRESS VARCHAR(30),
                          JOB_ID CHAR(9),
                          SALARY DECIMAL(10,2),
                          MANAGER_ID CHAR(9),
                          DEP_ID CHAR(9) NOT NULL,
                          PRIMARY KEY (EMP_ID)
                        );

 * sqlite:///database01.db
Done.

[]

In [40]:
%sql select * from EMPLOYEES

 * sqlite:///database01.db
Done.

[]

In [38]:
%%sql
BULK INSERT EMPLOYEES
FROM '/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/Employees.csv'
WITH (
      FORMAT = 'CSV',
      FIRSTROW = 1,
      FIELDTERMINATOR = ',',
      ROWTERMINATOR = '\n',
)

 * sqlite:///database01.db
(sqlite3.OperationalError) near "BULK": syntax error
[SQL: BULK INSERT EMPLOYEES
FROM 'Employees.csv'
WITH (
      FORMAT = 'CSV',
      FIRSTROW = 1,
      FIELDTERMINATOR = ',',
      ROWTERMINATOR = '\n',
)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [23]:
%%sql
select * from EMPLOYEES

 * sqlite:///database01.db
(sqlite3.OperationalError) no such table: EMPLOYEES
[SQL: select * from EMPLOYEES]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [19]:
%%sql
-- Create the tables

CREATE TABLE EMPLOYEES (
                          EMP_ID CHAR(9) NOT NULL,
                          F_NAME VARCHAR(15) NOT NULL,
                          L_NAME VARCHAR(15) NOT NULL,
                          SSN CHAR(9),
                          B_DATE DATE,
                          SEX CHAR,
                          ADDRESS VARCHAR(30),
                          JOB_ID CHAR(9),
                          SALARY DECIMAL(10,2),
                          MANAGER_ID CHAR(9),
                          DEP_ID CHAR(9) NOT NULL,
                          PRIMARY KEY (EMP_ID)
                        );

CREATE TABLE JOB_HISTORY (
                            EMPL_ID CHAR(9) NOT NULL,
                            START_DATE DATE,
                            JOBS_ID CHAR(9) NOT NULL,
                            DEPT_ID CHAR(9),
                            PRIMARY KEY (EMPL_ID,JOBS_ID)
                          );

CREATE TABLE JOBS (
                    JOB_IDENT CHAR(9) NOT NULL,
                    JOB_TITLE VARCHAR(30) ,
                    MIN_SALARY DECIMAL(10,2),
                    MAX_SALARY DECIMAL(10,2),
                    PRIMARY KEY (JOB_IDENT)
                  );

CREATE TABLE DEPARTMENTS (
                            DEPT_ID_DEP CHAR(9) NOT NULL,
                            DEP_NAME VARCHAR(15) ,
                            MANAGER_ID CHAR(9),
                            LOC_ID CHAR(9),
                            PRIMARY KEY (DEPT_ID_DEP)
                          );

CREATE TABLE LOCATIONS (
                          LOCT_ID CHAR(9) NOT NULL,
                          DEP_ID_LOC CHAR(9) NOT NULL,
                          PRIMARY KEY (LOCT_ID,DEP_ID_LOC)
                        );

 * sqlite:///database01.db
(sqlite3.OperationalError) table EMPLOYEES already exists
[SQL: -- Create the tables

CREATE TABLE EMPLOYEES (
                          EMP_ID CHAR(9) NOT NULL,
                          F_NAME VARCHAR(15) NOT NULL,
                          L_NAME VARCHAR(15) NOT NULL,
                          SSN CHAR(9),
                          B_DATE DATE,
                          SEX CHAR,
                          ADDRESS VARCHAR(30),
                          JOB_ID CHAR(9),
                          SALARY DECIMAL(10,2),
                          MANAGER_ID CHAR(9),
                          DEP_ID CHAR(9) NOT NULL,
                          PRIMARY KEY (EMP_ID)
                        );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [17]:
df = pd.read_csv("/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/Departments.csv", header=None)
df.to_sql("DEPARTMENTS", con, if_exists='replace', index=False,method="multi")

df = pd.read_csv("/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/Employees.csv", header=None)
df.to_sql("EMPLOYEES", con, if_exists='replace', index=False,method="multi")

df = pd.read_csv("/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/Jobs.csv", header=None)
df.to_sql("JOBS", con, if_exists='replace', index=False,method="multi")

df = pd.read_csv("/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/JobsHistory.csv", header=None)
df.to_sql("JOB_HISTORY", con, if_exists='replace', index=False,method="multi")

df = pd.read_csv("/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/Locations.csv", header=None)
df.to_sql("LOCATIONS", con, if_exists='replace', index=False,method="multi")

3

In [20]:
%%sql
select * from DEPARTMENTS

 * sqlite:///database01.db
Done.

[(2, 'Architect Group', 30001, 'L0001'),
 (5, 'Software Group', 30002, 'L0002'),
 (7, 'Design Team', 30003, 'L0003')]

In [24]:
df = pd.read_csv("/Users/macbook/Desktop/projects/Github_Repositories/IBM9_SQL/Locations.csv", header=None)
df.head()

       0  1
0  L0001  2
1  L0002  5
2  L0003  7

# Create View

In [11]:
%%sql
CREATE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES

 * sqlite:///database01.db
Done.

[]

In [13]:
SELECT * FROM EMPSALARY;

SyntaxError: invalid syntax (2551253063.py, line 1)

 * sqlite:///database01.db
(sqlite3.OperationalError) view EMPSALARY already exists
[SQL: CREATE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [15]:
%%sql
SELECT * FROM EMPSALARY;

 * sqlite:///database01.db
(sqlite3.OperationalError) no such column: EMP_ID
[SQL: SELECT * FROM EMPSALARY;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [16]:
%%sql
select * 
from Employees

 * sqlite:///database01.db
Done.

[('E1002', 'Alice', 'James', 123457, '07/31/1972', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5),
 ('E1003', 'Steve', 'Wells', 123458, '08/10/1980', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5),
 ('E1004', 'Santosh', 'Kumar', 123459, '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30004, 5),
 ('E1005', 'Ahmed', 'Hussain', 123410, '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2),
 ('E1006', 'Nancy', 'Allen', 123411, '02/06/1978', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2),
 ('E1007', 'Mary', 'Thomas', 123412, '05/05/1975', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7),
 ('E1008', 'Bharath', 'Gupta', 123413, '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7),
 ('E1009', 'Andrea', 'Jones', 123414, '07/09/1990', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7),
 ('E1010', 'Ann', 'Jacob', 123415, '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30004, 5)]